Revit 2027 API
BuiltInFailures.AutoRouteFailures.NotEnoughRoomForFittingsWarning Property
 There was not enough room to place the required fittings. Consider increasing the length of the segments, or moving them farther apart to generate a solution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotEnoughRoomForFittingsWarning { get; }
Public Shared ReadOnly Property NotEnoughRoomForFittingsWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotEnoughRoomForFittingsWarning {
	FailureDefinitionId^ get ();
}
static member NotEnoughRoomForFittingsWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace